{
    "contract_type": "Service Agreement",
    "effective_date": "2023-10-01",
    "parties": {
        "company": "Tech Solutions Inc.",
        "counterpart": "Global Services Co."
    },
    "scope_of_work": "Global Services Co. will provide IT consulting services, including software development and system maintenance, as described in Appendix A.",
    "payment_terms": {
        "payment_schedule": "Monthly",
        "payment_method": "Bank Transfer",
        "late_payment_interest": "2% per month for payments overdue by more than 15 days"
    },
    "termination_clause": {
        "termination_notice": "Either party may terminate this agreement with 30 days' written notice.",
        "termination_for_convenience": "Global Services Co. reserves the right to terminate this agreement for convenience upon 60 days' written notice to Tech Solutions Inc.",
        "termination_for_cause": "Either party may terminate this agreement immediately for material breach by the other party."
    },
    "confidentiality": {
        "confidential_information": "Both parties agree to keep all confidential information received during the contract term confidential and not disclose it to third parties.",
        "confidentiality_duration": "Confidentiality obligations shall survive the termination of this agreement for a period of 3 years."
    },
    "indemnification_clause": {
        "indemnification_scope": "Global Services Co. agrees to indemnify and hold harmless Tech Solutions Inc. from any claims, damages, or liabilities arising from Global Services Co.'s performance under this agreement.",
        "indemnification_limit": "Global Services Co.'s total liability for indemnification shall not exceed 150% of the total contract value."
    },
    "dispute_resolution": {
        "mediation": "In the event of a dispute, both parties agree to first attempt to resolve it through mediation before pursuing legal action.",
        "jurisdiction": "Any legal action arising from this agreement shall be brought in the state courts of California."
    },
    "insurance_requirements": {
        "insurance_coverage": "Global Services Co. shall maintain comprehensive general liability insurance with a minimum coverage of $2,000,000 during the contract term.",
        "certificate_of_insurance": "Global Services Co. shall provide Tech Solutions Inc. with a certificate of insurance as proof of coverage."
    },
    "governing_law": "This agreement shall be governed by and construed in accordance with the laws of the State of California.",
    "negotiation_history": [
        {
            "date": "2023-09-15",
            "party": "Tech Solutions Inc.",
            "change": "Adjusted payment schedule to monthly payments."
        },
        {
            "date": "2023-09-20",
            "party": "Global Services Co.",
            "change": "Accepted monthly payment schedule. Requested clarification on termination notice period."
        },
        {
            "date": "2023-09-25",
            "party": "Tech Solutions Inc.",
            "change": "Agreed to maintain a 30-day termination notice period as requested."
        },
        {
            "date": "2023-09-30",
            "party": "Global Services Co.",
            "change": "Requested an increase in the indemnification limit to 150% of the total contract value."
        },
        {
            "date": "2023-10-03",
            "party": "Tech Solutions Inc.",
            "change": "Accepted the increase in the indemnification limit."
        }
    ]
}
